{
  "backend/main.mo": "Defines the main backend actor with authorization, blob storage mixins, and comprehensive types for users, master data, dynamic forms, tasks, and SLAs.",
  "backend/migration.mo": "Migration module converting old task structures to the new Task format by transforming attached form IDs into structured attachment objects.",
  "feature_evidence.json": "Feature evidence report listing implemented features, associated files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for various frontend utility modules, components, hooks, and pages.",
  "frontend/index.css": "Tailwind CSS configuration defining design tokens, theme variables, and light/dark mode styling.",
  "frontend/index.html": "Basic HTML entry point loading the React application via main.tsx.",
  "frontend/src/App.tsx": "Configures the application router, route tree, and global providers including authentication wrapper and theming.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access‑denied message with a button to navigate back to the home page.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button using Internet Identity to log in or out, clearing React Query cache when logging out.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Renders a modal for collecting and saving a user's name, email, and department with validation and mutation handling.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Checks if the caller is an admin and either renders children, a loading state, or an access denied screen.",
  "frontend/src/components/auth/RequireAuth.tsx": "Ensures the user is authenticated and has a profile, showing login UI or profile setup before rendering children.",
  "frontend/src/components/forms/DynamicFormRenderer.tsx": "Dynamically renders form fields based on a form definition and submits collected form data.",
  "frontend/src/components/forms/FieldDefinitionRow.tsx": "Displays and edits a single form field definition including label, type, validation, and lookup options.",
  "frontend/src/components/forms/fields/FileUploadField.tsx": "Handles file selection, simulated upload progress, and removal, returning file metadata and bytes.",
  "frontend/src/components/forms/FormDefinitionEditor.tsx": "Provides UI to edit a form's name and manage its list of fields, including adding, updating, reordering, and removing fields.",
  "frontend/src/components/forms/SubmissionValueViewer.tsx": "Displays submitted form values using the form definition, formatting file, array, and primitive values.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main layout with sidebar navigation, admin/user sections, header, and footer around page content.",
  "frontend/src/components/layout/NavSection.tsx": "Renders a sidebar navigation section with labeled menu items and active-state handling.",
  "frontend/src/components/masters/FixedMasterCrud.tsx": "Reusable CRUD component for fixed master data with dialogs for create/update and a table for listing items.",
  "frontend/src/components/masters/MasterListEditor.tsx": "Editor for user-defined master lists, allowing creation, editing, and deletion of lists and their items.",
  "frontend/src/components/tasks/PickupTaskButton.tsx": "Button that triggers a task pickup mutation and shows success or error toasts.",
  "frontend/src/components/tasks/ReassignTaskDialog.tsx": "Dialog for reassigning a task to a user or department with form inputs and mutation handling.",
  "frontend/src/components/tasks/SlaStatusBadge.tsx": "Displays a badge indicating SLA status such as on-track, at-risk, or breached.",
  "frontend/src/components/tasks/TaskFormsPanel.tsx": "Shows a list of task-attached forms with completion status and actions to fill or view submissions.",
  "frontend/src/components/tasks/TaskFormSubmitDialog.tsx": "Dialog for loading a form definition and submitting task-related form data via a dynamic renderer.",
  "frontend/src/components/tasks/TaskJourneyTimeline.tsx": "Displays a vertical timeline of task journey events with timestamps, actions, and user info.",
  "frontend/src/components/tasks/TaskListTable.tsx": "Renders a table of tasks with status, priority, assignment, dates, form progress, and navigation actions.",
  "frontend/src/hooks/forms/useFormDefinitions.ts": "Provides React Query hooks to fetch, create, update, and delete form definitions via the actor API.",
  "frontend/src/hooks/forms/useFormSubmissions.ts": "Contains hooks for retrieving and submitting form submissions, including data conversion from backend formats.",
  "frontend/src/hooks/forms/useLookupOptions.ts": "Fetches lookup options for master data types, currently returning empty results pending backend support.",
  "frontend/src/hooks/masterData/useMasterData.ts": "Retrieves master data such as task types, priorities, statuses, departments, categories, and master lists from the backend.",
  "frontend/src/hooks/masters/useMasters.ts": "Defines placeholder query and mutation hooks for master data management, pending backend query implementations.",
  "frontend/src/hooks/tasks/useAssignmentActions.ts": "Provides task pickup and reassignment mutation hooks and triggers related query invalidation.",
  "frontend/src/hooks/tasks/useTaskDefinitionsAndTasks.ts": "Provides React Query hooks for fetching, creating, and updating tasks using the actor API with cache invalidation.",
  "frontend/src/hooks/tasks/useTaskJourney.ts": "Fetches a task's audit log and maps it into simplified journey events.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on the authenticated identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches the caller's user profile, role, and admin status through actor-backed queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, login, logout, and identity restoration via a React context.",
  "frontend/src/hooks/useQueries.ts": "Provides a mutation hook to save the caller’s user profile and invalidate related queries.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/admin/FormBuilderPage.tsx": "Admin page for creating, editing, and deleting form definitions with validation and backend mutations.",
  "frontend/src/pages/admin/MastersPage.tsx": "Admin UI for managing master data lists using CRUD hooks and tabbed navigation.",
  "frontend/src/pages/admin/TaskDefinitionsPage.tsx": "Admin page placeholder showing empty task definitions and disabled create/edit/delete actions.",
  "frontend/src/pages/tasks/CreateTaskPage.tsx": "Task creation form allowing users to attach forms and submit a new task to the backend.",
  "frontend/src/pages/tasks/DepartmentPoolPage.tsx": "Displays tasks available to a department using a shared task pool table.",
  "frontend/src/pages/tasks/FormSubmissionViewPage.tsx": "Loads a form submission and its definition for viewing, with navigation back to the task.",
  "frontend/src/pages/tasks/MyTasksPage.tsx": "Shows tasks assigned to the current user using a task list table.",
  "frontend/src/pages/tasks/TaskDetailPage.tsx": "Displays full task details, attached forms, journey events, and actions like pickup and reassign.",
  "frontend/src/utils/formDefinitionEncoding.ts": "Utilities for normalizing form definitions and fields for backend compatibility and converting field types to strings.",
  "frontend/src/utils/getErrorMessage.ts": "Converts unknown error values into readable messages with fallbacks.",
  "frontend/src/utils/navMatch.ts": "Determines active navigation state based on path matching rules and predefined app routes.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read URL parameters (including hash routes), persist them in sessionStorage, and clear them when needed.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, container settings, and loads typography, container-queries, and animation plugins.",
  "project_state.json": "Tracks project state, including version, feature summaries, architectural notes, and known issues related to the task and form management application."
}