{
  "backend/main.mo": "Defines the backend actor with authorization, blob storage mixins, and extensive types for users, master data, dynamic forms, and task management; state maps are initialized for storing system data.",
  "feature_evidence.json": "Lists implemented features with associated frontend files, components, test IDs, and confidence for feature tracking.",
  "frontend/index.css": "Configures Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/index.html": "Defines the HTML root container and loads the main React entry script.",
  "frontend/src/App.tsx": "Sets up the main application router, layout shell, authentication wrapper, and routes for admin and task pages.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied message with a button to navigate home.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides login/logout handling using Internet Identity with UI feedback.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog for creating a user profile with name, email, and department fields.",
  "frontend/src/components/auth/RequireAdmin.tsx": "Guards content so only admin users can access it, otherwise showing an access denied screen.",
  "frontend/src/components/auth/RequireAuth.tsx": "Handles authentication flow and prompts users to log in or complete profile setup before accessing the app.",
  "frontend/src/components/forms/DynamicFormRenderer.tsx": "Renders form fields dynamically based on a form definition, managing state and handling submissions for various field types including uploads.",
  "frontend/src/components/forms/FieldDefinitionRow.tsx": "Displays and edits a single form field definition with controls for label, type, validations, and optional lookup source.",
  "frontend/src/components/forms/fields/FileUploadField.tsx": "Handles file selection, simulated upload progress, and removal, passing file metadata and bytes back to the parent.",
  "frontend/src/components/forms/FormDefinitionEditor.tsx": "Provides an editor for form definitions, allowing adding, removing, updating, and reordering fields along with naming the form.",
  "frontend/src/components/forms/SubmissionValueViewer.tsx": "Shows a read-only view of submitted form values, formatting files, arrays, and simple values based on field definitions.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main application layout with sidebar navigation, header, footer, and admin/user-specific navigation items.",
  "frontend/src/components/layout/NavSection.tsx": "Renders a navigational section inside the sidebar, highlighting active routes and handling navigation callbacks.",
  "frontend/src/components/masters/FixedMasterCrud.tsx": "Reusable CRUD UI for fixed master data with dialog-based create/edit and table listing.",
  "frontend/src/components/masters/MasterListEditor.tsx": "Editor for user-defined master lists including item addition, removal, and CRUD actions.",
  "frontend/src/components/tasks/PickupTaskButton.tsx": "Button that triggers a task pickup mutation and shows pending state and toasts.",
  "frontend/src/components/tasks/ReassignTaskDialog.tsx": "Dialog for reassigning a task to a user or department with form inputs and mutation handling.",
  "frontend/src/components/tasks/SlaStatusBadge.tsx": "Displays a badge indicating SLA state such as on-track, at-risk, or breached.",
  "frontend/src/components/tasks/TaskFormsPanel.tsx": "Shows forms attached to a task with indicators for completion and actions to open or view submissions.",
  "frontend/src/components/tasks/TaskJourneyTimeline.tsx": "Renders a vertical timeline of task journey events with timestamps and details.",
  "frontend/src/components/tasks/TaskListTable.tsx": "Displays a table of tasks with status, assignment, SLA, form progress, and navigation actions.",
  "frontend/src/hooks/forms/useFormDefinitions.ts": "React Query hooks for fetching and mutating form definitions using an actor backend interface.",
  "frontend/src/hooks/forms/useFormSubmissions.ts": "Provides React Query hooks for fetching and submitting form submissions, currently using placeholder backend calls.",
  "frontend/src/hooks/forms/useLookupOptions.ts": "Fetches lookup option lists based on master type or list ID, returning empty arrays until backend queries exist.",
  "frontend/src/hooks/masters/useMasters.ts": "Contains query and mutation hooks for managing master data like departments, categories, statuses, and priorities with placeholder fetch logic.",
  "frontend/src/hooks/tasks/useAssignmentActions.ts": "Defines mutations for picking up and reassigning tasks, invalidating related task queries after success.",
  "frontend/src/hooks/tasks/useTaskDefinitionsAndTasks.ts": "Provides hooks to fetch and mutate task definitions and tasks, using placeholder backend calls and invalidating caches on changes.",
  "frontend/src/hooks/tasks/useTaskJourney.ts": "Fetches a task’s journey events with a placeholder backend call.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Provides hooks to fetch the current user's profile, role, and admin status using the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity integration, providing identity state, login, logout, and context management.",
  "frontend/src/hooks/useQueries.ts": "Adds a mutation hook for saving the caller’s user profile and refreshing related queries.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point wiring React Query, Internet Identity provider, and rendering the root App component.",
  "frontend/src/pages/admin/FormBuilderPage.tsx": "Admin page to list, create, edit, and delete form definitions using a form editor and CRUD hooks.",
  "frontend/src/pages/admin/MastersPage.tsx": "Admin interface with tabbed CRUD management for departments, categories, statuses, priorities, task types, and master lists.",
  "frontend/src/pages/admin/TaskDefinitionsPage.tsx": "Placeholder admin page for future task definition creation and management.",
  "frontend/src/pages/tasks/CreateTaskPage.tsx": "Placeholder page for creating tasks from task definitions with basic navigation UI.",
  "frontend/src/pages/tasks/DepartmentPoolPage.tsx": "Displays department‑assignable tasks using a task list table with loading support.",
  "frontend/src/pages/tasks/FormSubmissionViewPage.tsx": "Loads and displays a form submission with its form definition, handling missing or loading states.",
  "frontend/src/pages/tasks/MyTasksPage.tsx": "Shows the current user's assigned tasks in a list with loading indication.",
  "frontend/src/pages/tasks/TaskDetailPage.tsx": "Displays detailed task info, journey timeline, forms, and assignment actions with error and loading handling.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters, persisting them in sessionStorage, and manipulating hash query parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, custom colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "JSON storing project metadata, feature list, and requirements for a low‑code task and form management system with master data, dynamic forms, and workflows."
}