{
  "kind": "build_request",
  "title": "Implement Task Definitions with required multi-form attachment and per-form submissions inside tasks",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-20",
      "text": "Implement backend support for Task Definitions that require at least one attached Form Definition and allow attaching multiple forms per Task Definition.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "A task should always contain at least one form there should be options to select more than one form in a task."
        ]
      },
      "acceptanceCriteria": [
        "A TaskDefinition type exists in backend/main.mo with an ordered list of attached form references (at minimum: formId, and optionally a version).",
        "Backend exposes query methods to list and fetch Task Definitions (e.g., list/get by id) usable by the frontend.",
        "Backend exposes Admin-only mutation methods to create and update Task Definitions.",
        "Backend rejects create/update of a Task Definition when the attached forms list is empty, returning an explicit error (trap/message) rather than silently accepting it."
      ]
    },
    {
      "id": "REQ-21",
      "text": "Implement backend APIs to create Task instances from a selected Task Definition and ensure new tasks inherit the definition’s attached forms and initialize per-form completion tracking as incomplete for each attached form.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "An Admin creates a Task Definition → selects one or more form definitions → the task is later created normally, and users simply fill the attached forms inside that task."
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a create-task flow that takes a Task Definition id and task metadata and produces a new Task.",
        "The created Task.attachedForms matches the Task Definition’s attached forms.",
        "The created Task.formCompletionStatus includes an entry for every attached form, all initialized to not completed.",
        "The created Task is readable via an API used by the existing Task Detail route (/tasks/$taskId)."
      ]
    },
    {
      "id": "REQ-22",
      "text": "Implement backend support for task-scoped form submissions so that each attached form can be filled and saved/submitted individually within a task, and completion status updates per form upon submission.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "It means Every form can be filled and saved individually with in a Task."
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a submit API for saving a form submission that includes taskId, formId, formVersion, and field data.",
        "On successful submission, backend marks the corresponding entry in the task’s formCompletionStatus as completed for that formId.",
        "Backend exposes query methods to (a) list submissions for a task and (b) fetch a submission by submissionId, matching the frontend needs in frontend/src/hooks/forms/useFormSubmissions.ts.",
        "Submission fetching supports the existing FormSubmissionViewPage route (/tasks/$taskId/submissions/$submissionId)."
      ]
    },
    {
      "id": "REQ-23",
      "text": "Wire up React Query hooks for task definitions, tasks, and task form submissions so they call real backend actor methods instead of returning placeholders.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "yes implement again"
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/hooks/tasks/useTaskDefinitionsAndTasks.ts no longer returns empty arrays/null for task definition and task queries when an actor is available.",
        "frontend/src/hooks/tasks/useTaskDefinitionsAndTasks.ts mutations (create task definition, update task definition, create task) call corresponding backend actor methods and invalidate appropriate query keys.",
        "frontend/src/hooks/forms/useFormSubmissions.ts query hooks (getTaskSubmissions, getSubmission) and mutation (useSubmitForm) call corresponding backend actor methods and invalidate caches as expected.",
        "Any user-facing error messages shown as a result of failed calls are in English."
      ]
    },
    {
      "id": "REQ-24",
      "text": "Replace the placeholder Admin Task Definitions page with a working UI to list, create, and edit Task Definitions, including selecting one or more existing Form Definitions (multi-select) and enforcing the “at least one form” rule in the UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "An Admin creates a Task Definition → selects one or more form definitions"
        ]
      },
      "acceptanceCriteria": [
        "The Admin route /admin/task-definitions (frontend/src/pages/admin/TaskDefinitionsPage.tsx) displays existing task definitions from the backend.",
        "Admins can create a new Task Definition and select multiple existing Form Definitions to attach.",
        "The UI prevents saving a Task Definition if no forms are selected and shows a clear English validation message.",
        "Admins can edit an existing Task Definition and change its attached forms; after saving, the list reflects the update without a full page reload."
      ]
    },
    {
      "id": "REQ-25",
      "text": "Replace the placeholder Create Task page with a working UI that allows creating a Task from a selected Task Definition and required task metadata, then navigates to the new Task’s detail page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "the task is later created normally"
        ]
      },
      "acceptanceCriteria": [
        "The route /tasks/create (frontend/src/pages/tasks/CreateTaskPage.tsx) loads available Task Definitions and allows selecting one.",
        "Submitting the Create Task form calls the create task mutation and, on success, navigates to /tasks/$taskId for the newly created task.",
        "If backend rejects creation (e.g., invalid definition id), the UI shows an English error message and remains on the form page."
      ]
    },
    {
      "id": "REQ-26",
      "text": "Implement the Task Detail “fill form” and “view submission” actions so users can open an attached form, submit it for the task, and then view the saved submission from the task’s forms panel.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Every form can be filled and saved individually with in a Task."
        ]
      },
      "acceptanceCriteria": [
        "On /tasks/$taskId, clicking “Fill Form” opens a form UI for the selected attached form (using existing DynamicFormRenderer) and allows submitting it for that task.",
        "After submission, the task detail view reflects the updated per-form completion state (e.g., badge switches to Submitted).",
        "Clicking “View Submission” navigates to /tasks/$taskId/submissions/$submissionId and displays the saved submission using the existing FormSubmissionViewPage.",
        "All user-facing labels, buttons, and error messages in this flow are in English."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services.",
    "Create/upgrade backend/migration.mo only if new stable state or migrations are required; follow the project migration policy (conditional).",
    "Do not edit files under frontend/src/components/ui (shadcn components); compose them instead.",
    "Do not edit immutable frontend paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Use React + TypeScript + Tailwind + React Query per the existing stack; no third-party auth beyond Internet Identity.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Implementing the alternative flow where a new Task instance is automatically created by submitting a standalone form (form-driven task generation without task creation).",
    "Adding real-time updates (WebSockets) or push notifications for task/form state changes.",
    "Introducing external databases or non-Motoko backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}