{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Task Definitions with multi-form attachments and task-scoped form submissions (frontend wiring + UI)",
  "requirements": [
    {
      "id": "REQ-23",
      "summary": "Replace placeholder React Query hooks for task definitions, tasks, and task form submissions with real backend actor calls and proper cache invalidation.",
      "acceptanceCriteria": [
        "frontend/src/hooks/tasks/useTaskDefinitionsAndTasks.ts no longer returns empty arrays/null for task definition and task queries when an actor is available.",
        "frontend/src/hooks/tasks/useTaskDefinitionsAndTasks.ts mutations (create task definition, update task definition, create task) call corresponding backend actor methods and invalidate appropriate query keys.",
        "frontend/src/hooks/forms/useFormSubmissions.ts query hooks (getTaskSubmissions, getSubmission) and mutation (useSubmitForm) call corresponding backend actor methods and invalidate caches as expected.",
        "Any user-facing error messages shown as a result of failed calls are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Align frontend actor typings with the backend capabilities needed by the new hooks and UIs: add TaskDefinition types and actor methods for listing/fetching/creating/updating task definitions, creating a task from a definition, and task-scoped submission queries (list by task) and submission-by-id fetching; ensure submit flow returns/accepts the identifiers needed by /tasks/$taskId/submissions/$submissionId."
        },
        {
          "path": "frontend/src/hooks/tasks/useTaskDefinitionsAndTasks.ts",
          "operation": "modify",
          "description": "Wire task definition and task queries/mutations to real actor methods (no placeholders): implement list/fetch task definitions, getTask, getMyTasks, getDepartmentPoolTasks using available actor calls; implement create/update Task Definition and create task-from-definition mutations; add query key strategy and invalidate keys affecting lists and details; ensure thrown errors are surfaced as English messages when caught by pages."
        },
        {
          "path": "frontend/src/hooks/forms/useFormSubmissions.ts",
          "operation": "modify",
          "description": "Replace placeholders with actor calls for task-scoped submissions: implement getTaskSubmissions(taskId), getSubmission(submissionId), and submit-for-task mutation; after successful submit, invalidate the task detail query key (e.g., ['task', taskId]) and submissions query key (['taskSubmissions', taskId]) so per-form completion state and submission links refresh; use English error messages via the existing error handling patterns."
        },
        {
          "path": "frontend/src/utils/getErrorMessage.ts",
          "operation": "modify",
          "description": "If needed, extend error normalization to reliably produce English user-facing messages for common actor failures (including trap strings), without changing the default fallback message."
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Implement a working Admin Task Definitions UI with listing, create/edit dialogs, multi-select of Form Definitions, and client-side validation requiring at least one selected form.",
      "acceptanceCriteria": [
        "The Admin route /admin/task-definitions (frontend/src/pages/admin/TaskDefinitionsPage.tsx) displays existing task definitions from the backend.",
        "Admins can create a new Task Definition and select multiple existing Form Definitions to attach.",
        "The UI prevents saving a Task Definition if no forms are selected and shows a clear English validation message.",
        "Admins can edit an existing Task Definition and change its attached forms; after saving, the list reflects the update without a full page reload."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/admin/TaskDefinitionsPage.tsx",
          "operation": "modify",
          "description": "Replace placeholder content with a functional management UI: load task definitions via useGetTaskDefinitions and show them in a list/table; provide Create and Edit actions that open an editor dialog; refresh the list via React Query invalidation on successful mutations; display any failure as an English message (using getErrorMessage)."
        },
        {
          "path": "frontend/src/components/tasks/TaskDefinitionEditorDialog.tsx",
          "operation": "create",
          "description": "Create a composed (non-shadcn-modifying) dialog component for creating/editing a Task Definition: includes name/description inputs and an ordered multi-select of existing Form Definitions (loaded via useGetFormDefinitions); enforce the 'at least one form' rule with an English validation message; on save, call useCreateTaskDefinition or useUpdateTaskDefinition as appropriate."
        },
        {
          "path": "frontend/src/components/tasks/AttachedFormsMultiSelect.tsx",
          "operation": "create",
          "description": "Create a reusable multi-select UI for choosing one or more Form Definitions (checkbox list + optional search/filter and ordering controls) to attach to a Task Definition; keep the selected forms ordered; expose selected form ids (and optionally versions) to the editor dialog."
        },
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Ensure the admin navigation clearly links to Task Definitions (if not already present/visible) and remains guarded by the existing admin gating logic; do not introduce new routes beyond those already defined."
        }
      ]
    },
    {
      "id": "REQ-25",
      "summary": "Implement the Create Task UI to create a Task from a selected Task Definition and required metadata, then navigate to the new Task detail view.",
      "acceptanceCriteria": [
        "The route /tasks/create (frontend/src/pages/tasks/CreateTaskPage.tsx) loads available Task Definitions and allows selecting one.",
        "Submitting the Create Task form calls the create task mutation and, on success, navigates to /tasks/$taskId for the newly created task.",
        "If backend rejects creation (e.g., invalid definition id), the UI shows an English error message and remains on the form page."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/tasks/CreateTaskPage.tsx",
          "operation": "modify",
          "description": "Replace placeholder content with a working Create Task form: load task definitions via useGetTaskDefinitions; allow selecting a definition and entering required metadata (aligned to backend capability); call the create-task-from-definition mutation; on success navigate to /tasks/$taskId; on failure, show an English error message using getErrorMessage and keep the user on the page."
        },
        {
          "path": "frontend/src/hooks/tasks/useTaskDefinitionsAndTasks.ts",
          "operation": "modify",
          "description": "Update the create task mutation API shape to accept a Task Definition id plus task metadata (instead of constructing a full Task client-side), call the corresponding backend actor method, and return the created task id for navigation; invalidate task lists and task detail caches after success."
        }
      ]
    },
    {
      "id": "REQ-26",
      "summary": "Enable Task Detail form actions: open attached forms inside a task, submit per-form submissions, reflect completion state, and navigate to view saved submissions.",
      "acceptanceCriteria": [
        "On /tasks/$taskId, clicking “Fill Form” opens a form UI for the selected attached form (using existing DynamicFormRenderer) and allows submitting it for that task.",
        "After submission, the task detail view reflects the updated per-form completion state (e.g., badge switches to Submitted).",
        "Clicking “View Submission” navigates to /tasks/$taskId/submissions/$submissionId and displays the saved submission using the existing FormSubmissionViewPage.",
        "All user-facing labels, buttons, and error messages in this flow are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/tasks/TaskDetailPage.tsx",
          "operation": "modify",
          "description": "Replace console-based handlers with real actions: load the task via useGetTask; load task submissions via useGetTaskSubmissions; map each attached form to its display name (from FormDefinition when available) and latest submissionId; wire TaskFormsPanel callbacks to open a submit dialog and to navigate to the submission view route; after successful submission, refetch/invalidate task and submissions queries so completion badges update."
        },
        {
          "path": "frontend/src/components/tasks/TaskFormsPanel.tsx",
          "operation": "modify",
          "description": "Extend the panel to support both actions correctly: accept per-form submissionId (when completed) so 'View Submission' can navigate to a specific submission; keep English labels ('Fill Form', 'View Submission', 'Submitted', 'Not Started') and ensure the UI reflects completion accurately."
        },
        {
          "path": "frontend/src/components/tasks/TaskFormSubmitDialog.tsx",
          "operation": "create",
          "description": "Create a dialog that loads the selected FormDefinition and renders it using the existing DynamicFormRenderer; on submit, call useSubmitForm with taskId + selected form identifiers; show English validation/errors on submission failure using getErrorMessage; close dialog on success."
        },
        {
          "path": "frontend/src/hooks/forms/useFormSubmissions.ts",
          "operation": "modify",
          "description": "Ensure the submit mutation returns (or makes available) the created submission id needed for the 'View Submission' navigation, and invalidates ['task', taskId] plus ['taskSubmissions', taskId] so the Task Detail completion state and available submission links update immediately."
        },
        {
          "path": "frontend/src/pages/tasks/FormSubmissionViewPage.tsx",
          "operation": "modify",
          "description": "Keep the existing view but ensure it works with the real submission hook implementation; if needed, adjust to the updated submission type shape and make sure missing submission/form cases present English messages."
        }
      ]
    }
  ]
}