{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-06T19:36:59.747Z",
  "summary": "Diff implements task form attachments as per-task attachments with a completed flag (plus a migration), adds UI to fill/submit forms inside Task Detail via a dialog, and adds several React Query hooks for tasks, form submissions, and master data. However, Task Definitions (backend + frontend), creating tasks from a Task Definition, and true task-scoped submissions APIs are not implemented; the Admin Task Definitions page remains a placeholder and the Create Task page creates tasks directly with selected forms rather than from a Task Definition.",
  "missing_requirements": [
    {
      "id": "REQ-20",
      "requirement": "Backend support for Task Definitions with required non-empty ordered attached form references; query list/get; admin-only create/update; reject empty attached forms explicitly.",
      "reason": "backend/main.mo changes shown define Task and TaskFormAttachment, but there is no evidence of a TaskDefinition type, list/get APIs, or admin-only create/update methods, nor validation to reject empty attached forms for task definitions. Frontend Admin Task Definitions page explicitly states backend support is not present.",
      "evidence": [
        "backend/main.mo",
        "frontend/src/pages/admin/TaskDefinitionsPage.tsx"
      ]
    },
    {
      "id": "REQ-21",
      "requirement": "Backend API to create Task instances from a selected Task Definition id, inheriting attached forms and initializing per-form completion tracking as incomplete; task readable by Task Detail route.",
      "reason": "Frontend create flow calls actor.createTask(task) with a fully constructed Task (including attachedForms) rather than calling a create-task-by-definition API. No evidence in backend/main.mo diff of a method that takes a Task Definition id and generates a task that inherits attached forms from the definition.",
      "evidence": [
        "frontend/src/hooks/tasks/useTaskDefinitionsAndTasks.ts",
        "frontend/src/pages/tasks/CreateTaskPage.tsx",
        "backend/main.mo"
      ]
    },
    {
      "id": "REQ-22",
      "requirement": "Backend task-scoped form submissions: submit API includes taskId, formId, formVersion, and field data; on submit mark task’s per-form completion status completed; query list submissions for a task and fetch by submissionId for the submission view route.",
      "reason": "Frontend hook comments indicate backend lacks task-specific submission queries (uses actor.getMyFormSubmissions() and returns all user submissions) and derives a synthetic submissionId; useGetSubmission uses actor.getFormSubmission(submissionId) and sets taskId to 'unknown'. No evidence of backend APIs for task-scoped submission listing/fetching or marking task form completion on submission.",
      "evidence": [
        "frontend/src/hooks/forms/useFormSubmissions.ts"
      ]
    },
    {
      "id": "REQ-23",
      "requirement": "React Query hooks for task definitions, tasks, and task form submissions must call real backend actor methods (no placeholders), including task definition queries/mutations and task-scoped submission queries/mutation with correct cache invalidation; user-facing errors in English.",
      "reason": "Task definitions hooks are not present/used; Admin Task Definitions page is still placeholder. Form submissions hooks still rely on non-task-scoped backend methods and explicitly note the limitation. Task creation mutation calls actor.createTask but does not match the required create-task-from-definition flow.",
      "evidence": [
        "frontend/src/hooks/tasks/useTaskDefinitionsAndTasks.ts",
        "frontend/src/hooks/forms/useFormSubmissions.ts",
        "frontend/src/pages/admin/TaskDefinitionsPage.tsx"
      ]
    },
    {
      "id": "REQ-24",
      "requirement": "Replace placeholder Admin Task Definitions page with working UI to list/create/edit Task Definitions, multi-select forms, and enforce at-least-one-form validation; updates reflected without full reload.",
      "reason": "TaskDefinitionsPage.tsx remains explicitly a placeholder: it uses local empty state for taskDefinitions and shows toast messages stating creation/editing/deletion are not available and backend support is needed.",
      "evidence": [
        "frontend/src/pages/admin/TaskDefinitionsPage.tsx"
      ]
    },
    {
      "id": "REQ-25",
      "requirement": "Create Task page should create a Task from a selected Task Definition, call create task mutation, and navigate to the new task’s detail page; show English error on backend rejection.",
      "reason": "CreateTaskPage.tsx does not load/select Task Definitions. It instead selects task type/priority/status/due date and directly multi-selects Form Definitions, then constructs a Task client-side and calls createTask.mutateAsync(task).",
      "evidence": [
        "frontend/src/pages/tasks/CreateTaskPage.tsx",
        "frontend/src/hooks/tasks/useTaskDefinitionsAndTasks.ts"
      ]
    },
    {
      "id": "REQ-26",
      "requirement": "Task Detail 'Fill Form' and 'View Submission' should submit per task+form and then reflect updated per-form completion, and view submission via /tasks/$taskId/submissions/$submissionId using existing FormSubmissionViewPage.",
      "reason": "UI wiring for dialog and navigation exists, but the underlying submission data is not truly task-scoped (submissions list is all user submissions; submissionId is synthetic; fetched submission's taskId becomes 'unknown'), and there is no evidence that submitting updates the task’s per-form completion in backend (the dialog’s onSuccess only closes the dialog; no query invalidation for task is shown in the truncated submit hook).",
      "evidence": [
        "frontend/src/pages/tasks/TaskDetailPage.tsx",
        "frontend/src/components/tasks/TaskFormSubmitDialog.tsx",
        "frontend/src/hooks/forms/useFormSubmissions.ts",
        "frontend/src/pages/tasks/FormSubmissionViewPage.tsx"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Added new React Query hooks for Master Data (task types, priorities, statuses, departments, categories, master lists).",
      "reason": "BuildRequest focuses on Task Definitions, creating tasks from definitions, and task-scoped submissions; master data hooks are not requested as part of REQ-20 through REQ-26.",
      "evidence": [
        "frontend/src/hooks/masterData/useMasterData.ts"
      ]
    },
    {
      "description": "Added a Task Journey React Query hook mapping audit log entries to a JourneyEvent format.",
      "reason": "Task journey/audit log changes are not part of the requested requirements (REQ-20 to REQ-26).",
      "evidence": [
        "frontend/src/hooks/tasks/useTaskJourney.ts"
      ]
    },
    {
      "description": "Introduced a backend migration that changes Task.attachedForms representation to TaskFormAttachment with completed flag.",
      "reason": "The request is about Task Definitions and task-scoped submissions; it does not explicitly request changing the stable task model via migration. This may be necessary for REQ-21/REQ-22, but the diff summary provides no explicit linkage to requested Task Definition functionality.",
      "evidence": [
        "backend/migration.mo",
        "backend/main.mo"
      ]
    }
  ],
  "confidence": 0.82,
  "changed_files": [
    "backend/main.mo",
    "backend/migration.mo",
    "frontend-file-summaries.txt",
    "frontend/src/components/tasks/TaskFormSubmitDialog.tsx",
    "frontend/src/components/tasks/TaskFormsPanel.tsx",
    "frontend/src/components/tasks/TaskListTable.tsx",
    "frontend/src/hooks/forms/useFormSubmissions.ts",
    "frontend/src/hooks/masterData/useMasterData.ts",
    "frontend/src/hooks/tasks/useTaskDefinitionsAndTasks.ts",
    "frontend/src/hooks/tasks/useTaskJourney.ts",
    "frontend/src/pages/admin/TaskDefinitionsPage.tsx",
    "frontend/src/pages/tasks/CreateTaskPage.tsx",
    "frontend/src/pages/tasks/FormSubmissionViewPage.tsx",
    "frontend/src/pages/tasks/TaskDetailPage.tsx",
    "project_state.json"
  ]
}